/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "Bieżący katalog roboczy nie zawiera projektu platformy Cordova. Otwórz projekt platformy Cordova jako katalog główny obszaru roboczego i spróbuj ponownie.",
	"LaunchingForPlatform": "Trwa uruchamianie dla: {0} (może to trochę potrwać)...",
	"UnknownPlatform": "Nieznana platforma: {0}",
	"AttachingToApp": "Dołączanie do aplikacji",
	"CannotStartChildDebugSession": "Nie można uruchomić podrzędnej sesji debugowania",
	"CannotConnectToDebuggerWorkerProxyOffline": "Nie można połączyć się z procesem roboczym debugera: serwer proxy debugera Chrome jest w trybie offline",
	"CouldNotInitializeTelemetry": "Nie można zainicjować telemetrii. {0}",
	"CouldntoReadTheVisibleTextEditors": "Nie można odczytać widocznych edytorów tekstu. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Wystąpił błąd podczas dołączania do debugera. {0}",
	"ViewportResizingFailed": "Zmienianie rozmiaru okienka ekranu nie powiodło się. Spróbuj ponownie.",
	"UnableToLaunchiOSOnNonMacMachnines": "Nie można uruchamiać systemu iOS na komputerach innych niż Mac",
	"LaunchingApp": "Trwa uruchamianie aplikacji (może to trochę potrwać)...",
	"InstallingAndLaunchingAppOnDevice": "Instalowanie i uruchamianie aplikacji na urządzeniu",
	"UnableToRunWithGivenTarget": "Nie można uruchomić przy użyciu podanego obiektu docelowego.",
	"InvalidTargetPleaseCheckTargetParameter": "Nieprawidłowy obiekt docelowy. Sprawdź wartość parametru określającego obiekt docelowy w konfiguracji debugowania i upewnij się, że jest to prawidłowy identyfikator urządzenia iPhone. Przejdź do strony https://aka.ms/AA3xq86, aby uzyskać więcej informacji.",
	"UnableToFindWebview": "Nie można odnaleźć elementu Webview",
	"UnableToFindAppFile": "Nie można odnaleźć pliku app",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "Nie można skomunikować się z elementem ios_webkit_debug_proxy",
	"UnableToFindiOSTargetDeviceOrSimulator": "Nie można odnaleźć docelowego urządzenia/symulatora systemu iOS. Sprawdź, czy jest włączone ustawienie w obszarze „Ustawienia > Safari > Zaawansowane > Inspektor WWW”, lub spróbuj określić inny parametr „port” w pliku launch.json",
	"UnableToCommunicateWithTarget": "Nie można skomunikować się z obiektem docelowym",
	"UnableToFindTargetApp": "Nie można odnaleźć aplikacji docelowej",
	"WebsocketDebuggerUrlIsEmpty": "Adres URL debugera protokołu WebSocket jest pusty",
	"TheValueForDevServerPortMustBeInInterval": "Wartość „devServerPort” musi być liczbą z zakresu od 0 do 65535",
	"ErrorInTheIonicLiveReloadServer": "Błąd na serwerze ponownego ładowania na żywo platformy Ionic: {0}",
	"IonicNotFound": "Nie odnaleziono platformy Ionic. Uruchom polecenie „npm install –g ionic”, aby zainstalować ją globalnie",
	"InvalidAddress": "Nieprawidłowy adres: podaj prawidłowy adres IP lub nazwę hosta dla właściwości „devServerAddress” w pliku launch.json",
	"YourMachineHasMultipleNetworkAddresses": "Twój komputer ma wiele adresów sieciowych. Określ adres, za pomocą którego urządzenie lub emulator będzie komunikować się z serwerem deweloperskim, dodając właściwość \"devServerAddress\": \"ADRES\" do pliku .vscode/launch.json.\r\nAby uzyskać listę adresów, uruchom polecenie „ionic cordova run PLATFORMA --livereload” (gdzie wartość PLATFORMA jest nazwą platformy do uruchomienia) i poczekaj, aż pojawi się monit z tą listą.",
	"AvailableAdresses": " Dostępne adresy:",
	"StartingIonicDevServer": "Uruchamianie serwera deweloperskiego platformy Ionic (ponowne ładowanie na żywo: {0})",
	"StartingIonicDevServerTimedOut": "Upłynął limit czasu uruchamiania serwera deweloperskiego platformy Ionic ({0} ms)",
	"BuildingAndDeployingTheAppTimedOut": "Upłynął limit czasu kompilowania i wdrażania aplikacji ({0} ms)",
	"UnableToDetermineTheIonicDevServerAddress": "Nie można ustalić adresu serwera deweloperskiego platformy Ionic. Spróbuj uruchomić ponownie debuger",
	"ChromeError": "Błąd programu Chrome: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "Udostępnianie w przeglądarce jest obecnie obsługiwane tylko w przypadku projektów Ionic",
	"ErrorRunningAndroid": "Błąd uruchamiania systemu Android",
	"AppSuccessfullyLaunched": "Pomyślnie uruchomiono aplikację",
	"UnableToFindAdb": "Nie można odnaleźć narzędzia adb. Upewnij się, że jest ono uwzględnione w zmiennej PATH, i otwórz ponownie program Visual Studio Code",
	"UnableToFindLocalAbstractName": "Nie można odnaleźć nazwy „localabstract” dla aplikacji platformy Cordova",
	"ForwardingDebugPort": "Port przesyłania dalej na potrzeby debugowania",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Ostrzeżenie: ponowne ładowanie na żywo platformy Ionic jest obecnie obsługiwane tylko w przypadku projektów platformy Ionic 1. Wdrażanie będzie kontynuowane bez ponownego ładowania na żywo platformy Ionic...",
	"pidofNotFound": "/system/bin/sh: nie odnaleziono elementu pidof"
}