/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "Das aktuelle Arbeitsverzeichnis enthält kein Cordova-Projekt. Öffnen Sie ein Cordova-Projekt als Arbeitsbereichsstamm, und versuchen Sie es noch mal.",
	"LaunchingForPlatform": "Der Start für \"{0}\" wird ausgeführt. Dieser Vorgang kann etwas Zeit in Anspruch nehmen...",
	"UnknownPlatform": "Unbekannte Plattform: {0}",
	"AttachingToApp": "Anfügen an App",
	"CannotStartChildDebugSession": "Die untergeordnete Debugsitzung kann nicht gestartet werden.",
	"CannotConnectToDebuggerWorkerProxyOffline": "Verbindungsherstellung mit Debuggerworker nicht möglich: Der Chrome-Debuggerproxy ist offline.",
	"CouldNotInitializeTelemetry": "Die Telemetrie konnte nicht initialisiert werden. {0}",
	"CouldntoReadTheVisibleTextEditors": "Die sichtbaren Text-Editoren konnten nicht gelesen werden. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Fehler beim Anfügen an den Debugger. {0}",
	"ViewportResizingFailed": "Fehler beim Ändern der Größe des Viewports. Versuchen Sie es noch mal.",
	"UnableToLaunchiOSOnNonMacMachnines": "iOS kann auf Nicht-Mac-Computern nicht gestartet werden.",
	"LaunchingApp": "Die App wird gestartet. Dieser Vorgang kann etwas Zeit in Anspruch nehmen...",
	"InstallingAndLaunchingAppOnDevice": "Die App wird auf dem Gerät installiert und gestartet.",
	"UnableToRunWithGivenTarget": "Ausführung mit dem angegebenen Ziel nicht möglich.",
	"InvalidTargetPleaseCheckTargetParameter": "Ungültiges Ziel: Überprüfen Sie den Zielparameterwert in der Debugkonfiguration, und stellen Sie sicher, dass es sich um einen gültigen iPhone-Gerätebezeichner handelt. Weitere Informationen finden Sie unter https://aka.ms/AA3xq86.",
	"UnableToFindWebview": "Webview wurde nicht gefunden.",
	"UnableToFindAppFile": "Die APP-Datei wurde nicht gefunden.",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "Die Kommunikation mit \"ios_webkit_debug_proxy\" ist nicht möglich.",
	"UnableToFindiOSTargetDeviceOrSimulator": "Das iOS-Zielgerät bzw. der iOS-Simulator wurde nicht gefunden. Überprüfen Sie, ob in \"Einstellungen\" > \"Safari\" > \"Erweitert\" die Option \"Web Inspector\" auf EIN festgelegt ist, oder geben Sie in \"launch.json\" einen anderen Wert für den Parameter \"port\" an.",
	"UnableToCommunicateWithTarget": "Kommunikation mit Ziel nicht möglich.",
	"UnableToFindTargetApp": "Die Ziel-App wurde nicht gefunden.",
	"WebsocketDebuggerUrlIsEmpty": "Die WebSocket-Debugger-URL ist leer.",
	"TheValueForDevServerPortMustBeInInterval": "Der Wert für \"devServerPort\" muss eine Zahl zwischen 0 und 65535 sein.",
	"ErrorInTheIonicLiveReloadServer": "Fehler im Ionic Live Reload-Server: {0}",
	"IonicNotFound": "Ionic wurde nicht gefunden. Führen Sie \"npm install –g ionic\" aus, um Ionic global zu installieren.",
	"InvalidAddress": "Ungültige Adresse: Geben Sie eine gültige IP-Adresse oder einen gültigen Hostnamen für die Eigenschaft \"devServerAddress\" in \"launch.json\" an.",
	"YourMachineHasMultipleNetworkAddresses": "Ihr Computer weist mehrere Netzwerkadressen auf. Geben Sie an, welche Adresse Ihr Gerät oder Emulator für die Kommunikation mit dem Entwicklungsserver verwenden soll, indem Sie eine Eigenschaft \"devServerAddress\": \"ADRESSE\" in \".vscode/launch.json\" einfügen.\r\nFühren Sie zum Abrufen der Liste mit Adressen \"ionic cordova run PLATTFORM --livereload\" aus (hierbei steht PLATTFORM für den Namen der ausgeführten Plattform). Warten Sie, bis eine Eingabeaufforderung mit der Liste angezeigt wird.",
	"AvailableAdresses": " Verfügbare Adressen:",
	"StartingIonicDevServer": "Der Ionic-Entwicklungsserver wird gestartet (Live Reload: {0}).",
	"StartingIonicDevServerTimedOut": "Timeout beim Starten des Ionic-Entwicklungsservers ({0} ms).",
	"BuildingAndDeployingTheAppTimedOut": "Timeout beim Kompilieren und Bereitstellen der App ({0} ms).",
	"UnableToDetermineTheIonicDevServerAddress": "Die Adresse des Ionic-Entwicklungsservers kann nicht ermittelt werden. Starten Sie den Debugger neu.",
	"ChromeError": "Chrome-Fehler: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "\"An Browser senden\" wird zurzeit nur für Ionic-Projekte unterstützt.",
	"ErrorRunningAndroid": "Fehler beim Ausführen von Android.",
	"AppSuccessfullyLaunched": "App erfolgreich gestartet",
	"UnableToFindAdb": "\"adb\" wurde nicht gefunden. Stellen Sie sicher, dass \"adb\" in PATH enthalten ist, und öffnen Sie Visual Studio Code erneut.",
	"UnableToFindLocalAbstractName": "Der Name \"localabstract\" der Cordova-App wurde nicht gefunden.",
	"ForwardingDebugPort": "Debugport zur Weiterleitung",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Warnung: Ionic Live Reload wird zurzeit nur für Ionic 1-Projekte unterstützt. Die Bereitstellung wird ohne Ionic Live Reload fortgesetzt...",
	"pidofNotFound": "\"/system/bin/sh: pidof:\" wurde nicht gefunden.",
	"AttachingToPlatform": "Anhängen an {0}",
	"ReattachingToApp": "Der Versuch, eine Verbindung zur App herzustellen, ist fehlgeschlagen. Es wird versucht, die Verbindung erneut herzustellen ..."
}