/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
    "IonicLiveReloadIsOnlySupportedForIonic1": "Warnung: Ionic Live Reload wird derzeit nur für Ionic 1-Projekte unterstützt, die Bereitstellung wird ohne Ionic Live Reload fortgesetzt ...",
    "TheValueForDevServerPortMustBeInInterval": "Der Wert für „devServerPort“ muss eine Zahl zwischen 0 und 65535 sein",
    "StartingIonicDevServerTimedOut": "Zeitüberschreitung beim Starten des Ionic-Entwicklungsservers ({0} ms)",
    "BuildingAndDeployingTheAppTimedOut": "Zeitüberschreitung beim Erstellen und Bereitstellen der App ({0} ms)",
    "IonicNotFound": "Ionic wurde nicht gefunden. Bitte führen Sie „npm install –g ionic“ aus, um es global zu installieren",
    "InvalidAddress": "Ungültige Adresse: Bitte geben Sie eine gültige IP-Adresse oder einen gültigen Hostnamen für die Eigenschaft „devServerAddress“ in launch.json an",
    "StartingIonicDevServer": "Ionic-Entwicklungsserver wird gestartet (Live-Neuladen: {0})",
    "AvailableAdresses": " Verfügbare Adressen:",
    "ErrorInTheIonicLiveReloadServer": "Fehler im Ionic-Live-Reload-Server: {0}",
    "YourMachineHasMultipleNetworkAddresses": "Ihr Computer verfügt über mehrere Netzwerkadressen. Bitte geben Sie an, welche Ihr Gerät oder Emulator für die Kommunikation mit dem Entwicklungsserver verwendet, indem Sie die Eigenschaft „devServerAddress“: „ADDRESS“ zu .vscode/launch.json hinzufügen. Um die Liste der Adressen zu erhalten, führen Sie „ionic cordova run PLATFORM --livereload“ aus (wobei PLATFORM der Name der auszuführenden Plattform ist) und warten Sie, bis eine Eingabeaufforderung mit dieser Liste angezeigt wird."
}