/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "O diretório de trabalho atual não contém nenhum projeto do Cordova. Abra um projeto do Cordova como uma raiz de workspace e tente novamente.",
	"LaunchingForPlatform": "Iniciação para {0} (Isso pode demorar um pouco)...",
	"UnknownPlatform": "Plataforma Desconhecida: {0}",
	"AttachingToApp": "Fazendo a anexação ao aplicativo",
	"CannotStartChildDebugSession": "Não é possível iniciar a sessão de depuração filho",
	"CannotConnectToDebuggerWorkerProxyOffline": "Não é possível conectar-se com o trabalho do depurador: o proxy do depurador do Chrome está offline",
	"CouldNotInitializeTelemetry": "Não foi possível inicializar a telemetria. {0}",
	"CouldntoReadTheVisibleTextEditors": "Não foi possível ler os editores de texto visíveis. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Ocorreu um erro ao fazer a anexação ao depurador. {0}",
	"ViewportResizingFailed": "Falha no redimensionamento do visor. Tente novamente.",
	"UnableToLaunchiOSOnNonMacMachnines": "Não é possível iniciar o iOS em computadores que não sejam Mac",
	"LaunchingApp": "Iniciando o aplicativo (Isso pode demorar um pouco)...",
	"InstallingAndLaunchingAppOnDevice": "Instalando e iniciando o aplicativo no dispositivo",
	"UnableToRunWithGivenTarget": "Não é possível realizar a execução com o destino fornecido.",
	"InvalidTargetPleaseCheckTargetParameter": "Destino inválido. Confira o valor do parâmetro de destino na configuração de depuração e verifique se ele é um identificador de dispositivo iPhone válido. Acesse https://aka.ms/AA3xq86 para obter mais informações.",
	"UnableToFindWebview": "Não é possível localizar o modo de exibição da Web",
	"UnableToFindAppFile": "Não é possível localizar o arquivo .app",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "Não é possível se comunicar com o ios_webkit_debug_proxy",
	"UnableToFindiOSTargetDeviceOrSimulator": "Não é possível localizar o dispositivo/simulador iOS de destino. Verifique se \"Configurações > Safari > Avançado > Inspetor Web = ON\" ou tente especificar um parâmetro \"port\" diferente em launch.json",
	"UnableToCommunicateWithTarget": "Não é possível se comunicar com o destino",
	"UnableToFindTargetApp": "Não é possível localizar o aplicativo de destino",
	"WebsocketDebuggerUrlIsEmpty": "A URL do Depurador do WebSocket está vazia",
	"TheValueForDevServerPortMustBeInInterval": "O valor de \"devServerPort\" precisa ser um número entre 0 e 65.535",
	"ErrorInTheIonicLiveReloadServer": "Erro no servidor de recarga dinâmica do Ionic: {0}",
	"IonicNotFound": "O Ionic não foi encontrado. Execute 'npm install –g ionic' para instalá-lo globalmente",
	"InvalidAddress": "Endereço inválido: forneça um endereço IP ou um nome do host válido para a propriedade \"devServerAddress\" em launch.json",
	"YourMachineHasMultipleNetworkAddresses": "Seu computador tem vários endereços de rede. Especifique qual deles o dispositivo ou o emulador usará para comunicar-se com o servidor de desenvolvimento adicionando uma propriedade \"devServerAddress\": \"ADDRESS\" ao .vscode/launch.json.\r\nPara obter a lista de endereços, execute \"ionic cordova run PLATFORM --livereload\" (em que PLATFORM é o nome da plataforma a ser executada) e aguarde até que um prompt com essa lista seja exibido.",
	"AvailableAdresses": " Endereços disponíveis:",
	"StartingIonicDevServer": "Iniciando o servidor de desenvolvimento do Ionic (recarga dinâmica: {0})",
	"StartingIonicDevServerTimedOut": "Tempo limite atingido ao iniciar o servidor de desenvolvimento do Ionic ({0} ms)",
	"BuildingAndDeployingTheAppTimedOut": "A compilação e a implantação do aplicativo atingiram o tempo limite ({0} ms)",
	"UnableToDetermineTheIonicDevServerAddress": "Não é possível determinar o endereço do servidor de desenvolvimento do Ionic. Tente reiniciar o depurador",
	"ChromeError": "Erro do chrome: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "No momento, só há suporte para o funcionamento no navegador dos projetos do Ionic",
	"ErrorRunningAndroid": "Erro ao executar o Android",
	"AppSuccessfullyLaunched": "Aplicativo iniciado com êxito",
	"UnableToFindAdb": "Não é possível localizar o adb. Verifique se ele está no PATH e reabra o Visual Studio Code",
	"UnableToFindLocalAbstractName": "Não é possível localizar o nome 'localabstract' do aplicativo Cordova",
	"ForwardingDebugPort": "Porta de depuração de encaminhamento",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Aviso: no momento, há suporte para a recarga dinâmica do Ionic somente nos projetos do Ionic 1. Continuando a implantação sem a recarga dinâmica do Ionic...",
	"pidofNotFound": "/system/bin/sh: pidof: não encontrado"
}