/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "La directory di lavoro corrente non contiene alcun progetto Cordova. Aprire un progetto Cordova come radice dell'area di lavoro e riprovare.",
	"LaunchingForPlatform": "Avvio per {0}. L'operazione potrebbe richiedere qualche istante...",
	"UnknownPlatform": "Piattaforma sconosciuta: {0}",
	"AttachingToApp": "Collegamento all'app",
	"CannotStartChildDebugSession": "Non è possibile avviare la sessione di debug figlio",
	"CannotConnectToDebuggerWorkerProxyOffline": "Non è possibile connettersi al ruolo di lavoro del debugger: il proxy del debugger Chrome è offline",
	"CouldNotInitializeTelemetry": "Non è stato possibile inizializzare la telemetria. {0}",
	"CouldntoReadTheVisibleTextEditors": "Non è stato possibile leggere gli editor di testo visibili. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Si è verificato un errore durante il collegamento al debugger. {0}",
	"ViewportResizingFailed": "Il ridimensionamento del viewport non è riuscito. Riprovare.",
	"UnableToLaunchiOSOnNonMacMachnines": "Non è possibile avviare iOS in computer non Mac",
	"LaunchingApp": "Avvio dell'app. L'operazione potrebbe richiedere qualche istante...",
	"InstallingAndLaunchingAppOnDevice": "Installazione e avvio dell'app nel dispositivo",
	"UnableToRunWithGivenTarget": "Non è possibile usare la destinazione specificata per l'esecuzione.",
	"InvalidTargetPleaseCheckTargetParameter": "Destinazione non valida. Verificare il valore del parametro di destinazione nella configurazione di debug e assicurarsi che sia un identificatore di dispositivo iPhone valido. Per altre informazioni, vedere https://aka.ms/AA3xq86.",
	"UnableToFindWebview": "Non è possibile trovare la webview",
	"UnableToFindAppFile": "Non è possibile trovare il file con estensione .app",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "Non è possibile comunicare con ios_webkit_debug_proxy",
	"UnableToFindiOSTargetDeviceOrSimulator": "Non è possibile trovare il simulatore/dispositivo di destinazione iOS. Verificare che \"Impostazioni > Safari > Avanzate > Web Inspector = ON\" oppure provare a specificare un parametro \"port\" diverso in launch.json",
	"UnableToCommunicateWithTarget": "Non è possibile comunicare con la destinazione",
	"UnableToFindTargetApp": "Non è possibile trovare l'app di destinazione",
	"WebsocketDebuggerUrlIsEmpty": "L'URL del debugger WebSocket è vuoto",
	"TheValueForDevServerPortMustBeInInterval": "Il valore per \"devServerPort\" deve essere un numero compreso tra 0 e 65535",
	"ErrorInTheIonicLiveReloadServer": "Errore nel server di ricaricamento in tempo reale Ionic: {0}",
	"IonicNotFound": "Ionic non è sto trovato. Eseguire 'npm install -g ionic' per installarlo a livello globale",
	"InvalidAddress": "Indirizzo non valido: specificare un indirizzo IP o un nome host valido per la proprietà \"devServerAddress\" in launch.json",
	"YourMachineHasMultipleNetworkAddresses": "Per il computer esistono più indirizzi di rete. Per specificare quello usato dal dispositivo o dall'emulatore per comunicare con il server di sviluppo, aggiungere una proprietà \"devServerAddress\": \"ADDRESS\" in .vscode/launch.json.\r\nPer ottenere l'elenco degli indirizzi, eseguire \"ionic cordova run PLATFORM --livereload\" (dove PLATFORM è il nome della piattaforma da eseguire) e attendere finché non viene visualizzato il prompt con questo elenco.",
	"AvailableAdresses": " Indirizzi disponibili:",
	"StartingIonicDevServer": "Avvio del server di sviluppo Ionic (ricaricamento in tempo reale: {0})",
	"StartingIonicDevServerTimedOut": "Si è verificato un timeout durante l'avvio del server di sviluppo Ionic ({0} ms)",
	"BuildingAndDeployingTheAppTimedOut": "Si è verificato un timeout durante la compilazione e la distribuzione dell'app ({0} ms)",
	"UnableToDetermineTheIonicDevServerAddress": "Non è possibile determinare l'indirizzo del server di sviluppo Ionic. Provare a riavviare il debugger",
	"ChromeError": "Errore di Chrome: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "L'uso per il browser è attualmente supportato solo per i progetti Ionic",
	"ErrorRunningAndroid": "Errore durante l'esecuzione di Android",
	"AppSuccessfullyLaunched": "L'app è stata avviata",
	"UnableToFindAdb": "Non è possibile trovare adb. Assicurarsi che sia presente in PATH e riaprire Visual Studio Code",
	"UnableToFindLocalAbstractName": "Non è possibile trovare il nome 'localabstract' dell'app Cordova",
	"ForwardingDebugPort": "Inoltro della porta di debug",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Avviso: il ricaricamento in tempo reale Ionic è attualmente supportato solo per i progetti Ionic 1. La distribuzione continuerà senza il ricaricamento in tempo reale Ionic...",
	"pidofNotFound": "/system/bin/sh: pidof: non trovato"
}