/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "El directorio de trabajo actual no contiene un proyecto de Cordova. Abra un proyecto de Cordova como raíz del área de trabajo y vuelva a intentarlo.",
	"LaunchingForPlatform": "Iniciando para {0} (esta operación puede tardar varios minutos)...",
	"UnknownPlatform": "Plataforma desconocida: {0}",
	"AttachingToApp": "Asociando a la aplicación",
	"CannotStartChildDebugSession": "No se puede iniciar la sesión de depuración secundaria.",
	"CannotConnectToDebuggerWorkerProxyOffline": "No se puede conectar al trabajo del depurador: el proxy del depurador de Chrome está sin conexión.",
	"CouldNotInitializeTelemetry": "No se pudo inicializar la telemetría. {0}",
	"CouldntoReadTheVisibleTextEditors": "No se pudieron leer los editores de texto visibles. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Error al asociar al depurador. {0}",
	"ViewportResizingFailed": "Error al cambiar el tamaño de la ventanilla. Vuelva a intentarlo.",
	"UnableToLaunchiOSOnNonMacMachnines": "No se puede iniciar iOS en máquinas que no sean Mac.",
	"LaunchingApp": "Iniciando la aplicación (esta operación puede tardar varios minutos)...",
	"InstallingAndLaunchingAppOnDevice": "Instalando e iniciando la aplicación en el dispositivo",
	"UnableToRunWithGivenTarget": "No se puede ejecutar con el destino dado.",
	"InvalidTargetPleaseCheckTargetParameter": "Destino no válido. Compruebe el valor del parámetro de destino en la configuración de depuración y asegúrese de que sea un identificador de dispositivo iPhone válido. Consulte https://aka.ms/AA3xq86 para obtener más información.",
	"UnableToFindWebview": "No se encuentra la vista web.",
	"UnableToFindAppFile": "No se encuentra el archivo .app.",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "No se puede comunicar con ios_webkit_debug_proxy.",
	"UnableToFindiOSTargetDeviceOrSimulator": "No se encuentra el simulador o el dispositivo de destino de iOS. Compruebe que \"Ajustes > Safari > Avanzado > Inspector web = ACTIVADO\" o pruebe a especificar otro parámetro \"port\" distinto en launch.json.",
	"UnableToCommunicateWithTarget": "No se puede comunicar con el destino.",
	"UnableToFindTargetApp": "No se encuentra la aplicación de destino.",
	"WebsocketDebuggerUrlIsEmpty": "La dirección URL del depurador de WebSocket está vacía.",
	"TheValueForDevServerPortMustBeInInterval": "El valor de \"devServerPort\" debe ser un número entre 0 y 65535.",
	"ErrorInTheIonicLiveReloadServer": "Error del servidor de recarga en vivo de Ionic: {0}",
	"IonicNotFound": "No se encontró Ionic; ejecute \"npm install –g ionic\" para instalarlo de forma global.",
	"InvalidAddress": "Dirección no válida: proporcione una dirección IP o un nombre de host válidos para la propiedad \"devServerAddress\" en launch.json.",
	"YourMachineHasMultipleNetworkAddresses": "La máquina tiene varias direcciones de red. Especifique cuál usará el dispositivo o el emulador para comunicarse con el servidor de desarrollo mediante la adición de una propiedad \"devServerAddress\": \"ADDRESS\" a .vscode/launch.json.\r\nPara obtener la lista de direcciones, ejecute \"ionic cordova run PLATFORM --livereload\" (donde PLATFORM es el nombre de la plataforma que se va a ejecutar) y espere hasta que aparezca el símbolo del sistema con esta lista.",
	"AvailableAdresses": " Direcciones disponibles:",
	"StartingIonicDevServer": "Iniciando el servidor de desarrollo de Ionic (recarga en vivo: {0})",
	"StartingIonicDevServerTimedOut": "Se agotó el tiempo de espera para el inicio del servidor de desarrollo de Ionic ({0} ms)",
	"BuildingAndDeployingTheAppTimedOut": "Se agotó el tiempo de espera para compilar e implementar la aplicación ({0} ms)",
	"UnableToDetermineTheIonicDevServerAddress": "No se puede determinar la dirección del servidor de desarrollo de Ionic; pruebe a reiniciar el depurador.",
	"ChromeError": "Error de Chrome: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "El servicio al explorador solo se admite para los proyectos de Ionic.",
	"ErrorRunningAndroid": "Error al ejecutar Android",
	"AppSuccessfullyLaunched": "La aplicación se inició correctamente",
	"UnableToFindAdb": "No se encuentra adb. Asegúrese de que está en PATH y vuelva a abrir Visual Studio Code.",
	"UnableToFindLocalAbstractName": "No se encuentra el nombre \"localabstract\" de la aplicación de Cordova.",
	"ForwardingDebugPort": "Reenviando el puerto de depuración",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Advertencia: La recarga en vivo de Ionic solo se admite para proyectos de Ionic 1. Continuando la implementación sin la recarga en vivo de Ionic...",
	"pidofNotFound": "No se encontró /system/bin/sh: pidof:"
}