/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"CurrentCWDDoesntContainACordovaProject": "Aktuální pracovní adresář neobsahuje žádný projekt Cordova. Otevřete prosím projekt Cordova jako kořen pracovního prostoru a zkuste to znovu.",
	"LaunchingForPlatform": "Spouštění pro {0} (může to chvíli trvat)...",
	"UnknownPlatform": "Neznámá platforma: {0}",
	"AttachingToApp": "Probíhá připojování k aplikaci.",
	"CannotStartChildDebugSession": "Nepovedlo se spustit podřízenou relaci ladění",
	"CannotConnectToDebuggerWorkerProxyOffline": "Nejde se připojit k pracovnímu procesu ladicího programu: proxy ladicího programu pro Chrome je offline.",
	"CouldNotInitializeTelemetry": "Nešlo inicializovat telemetrii. {0}",
	"CouldntoReadTheVisibleTextEditors": "Nešlo přečíst viditelné textové editory. {0}",
	"AnErrorOccuredWhileAttachingToTheDebugger": "Při připojování k ladicímu programu došlo k chybě. {0}",
	"ViewportResizingFailed": "Nepovedlo se změnit velikost oblasti zobrazení. Zkuste to prosím znovu.",
	"UnableToLaunchiOSOnNonMacMachnines": "Nejde spustit iOS na jiných počítačích než Mac",
	"LaunchingApp": "Spouští se aplikace (může to chvíli trvat)...",
	"InstallingAndLaunchingAppOnDevice": "Probíhá instalace a spuštění aplikace na zařízení",
	"UnableToRunWithGivenTarget": "Nejde spustit s daným cílem.",
	"InvalidTargetPleaseCheckTargetParameter": "Neplatný cíl. Zkontrolujte prosím hodnotu parametru target v konfiguraci ladění a ujistěte se, že se jedná o platný identifikátor zařízení iPhone. Další informace najdete na adrese https://aka.ms/AA3xq86.",
	"UnableToFindWebview": "Nepovedlo se najít Webview",
	"UnableToFindAppFile": "Nepovedlo se najít soubor. app",
	"UnableToCommunicateWithiOSWebkitDebugProxy": "Nejde komunikovat s ios_webkit_debug_proxy",
	"UnableToFindiOSTargetDeviceOrSimulator": "Nepovedlo se najít cílové zařízení s iOSem nebo jeho simulátor. Zkontrolujte prosím, jestli máte zapnutý webový inspektor v části Nastavení > Safari > Pokročilé nebo zkuste zadat jiný parametr port v souboru launch.json.",
	"UnableToCommunicateWithTarget": "Nejde komunikovat s cílem",
	"UnableToFindTargetApp": "Nepovedlo se najít cílovou aplikaci",
	"WebsocketDebuggerUrlIsEmpty": "Adresa URL ladicího programu WebSocket je prázdná",
	"TheValueForDevServerPortMustBeInInterval": "Hodnotou parametru devServerPort musí být číslo v rozmezí 0 až 65535.",
	"ErrorInTheIonicLiveReloadServer": "Chyba na serveru Ionic pro živé opakované načítání: {0}",
	"IonicNotFound": "Nešlo najít Ionic. Nainstalujte ho prosím globálně spuštěním příkazu npm install –g ionic.",
	"InvalidAddress": "Neplatná adresa: Zadejte prosím platnou IP adresu nebo název hostitele pro vlastnost devServerAddress v souboru launch.json.",
	"YourMachineHasMultipleNetworkAddresses": "Váš počítač má několik síťových adres. Určete prosím, kterou z nich bude zařízení nebo emulátor používat ke komunikaci se serverem pro vývoj tak, že přidáte vlastnost devServerAddress: ADRESA do souboru .vscode/launch.json.\r\nPokud chcete získat seznam adres, spusťte příkaz ionic cordova run PLATFORMA --livereload (kde PLATFORMA je název platformy, která se má spustit) a počkejte, dokud se neobjeví seznam.",
	"AvailableAdresses": " Dostupné adresy:",
	"StartingIonicDevServer": "Spouští se server Ionic pro vývoj (živé opakované načítání: {0})",
	"StartingIonicDevServerTimedOut": "Vypršel časový limit spuštění serveru Ionic pro vývoj ({0} ms)",
	"BuildingAndDeployingTheAppTimedOut": "Vypršel časový limit pro sestavení a nasazení aplikace ({0} ms)",
	"UnableToDetermineTheIonicDevServerAddress": "Nejde určit adresu serveru Ionic pro vývoj. Zkuste prosím znovu spustit ladicí program.",
	"ChromeError": "Chyba Chromu: {0}",
	"ServingToTheBrowserIsSupportedForIonicProjects": "Předložení prohlížeči se momentálně podporuje jenom pro projekty Ionic.",
	"ErrorRunningAndroid": "Chyba při spouštění Androidu",
	"AppSuccessfullyLaunched": "Aplikace se úspěšně spustila.",
	"UnableToFindAdb": "Nepovedlo se najít adb. Ujistěte se prosím, že je v cestě PATH, a znovu otevřete Visual Studio Code.",
	"UnableToFindLocalAbstractName": "Nepovedlo se najít název localabstract aplikace Cordova",
	"ForwardingDebugPort": "Port pro přesměrování při ladění",
	"IonicLiveReloadIsOnlySupportedForIonic1": "Upozornění: Živé opakované načítání Ionicu se v současnosti podporuje jenom pro projekty Ionic 1. Nasazení bude pokračovat bez živého opakovaného načítání Ionicu...",
	"pidofNotFound": "/system/bin/sh: pidof: nenalezeno",
	"AttachingToPlatform": "Připojování k {0}",
	"ReattachingToApp": "Pokus o připojení k aplikaci se nezdařil. Pokus o opětovné připojení..."
}